// Завдання 1+2 (Виконати завдання про пори року за допомогою "?" ТА зробити так, щоб розуміло з великими та маленькими літерами)
var season=prompt("Введіть пору року:","");
  (season=="осінь" || season=="Осінь") ? alert("Пора року Осінь")
: (season=="зима"  || season=="Зима")  ? alert("Пора року Зима")
: (season=="весна" || season=="Весна") ? alert("Пора року Весна")
: (season=="літо"  || season=="Літо")  ? alert("Пора року Літо")
:                                        alert("Такої пори року не існує!")

// Завдання 3 (Визначення чверті, до якої належить задане число)
var minutes=+prompt("Введіть число від 0 до 59:",0);
if (minutes>=0 && minutes<=14) {
	alert("Число "+minutes+" належить першій чверті!")
} else if (minutes>=15 && minutes<=29) {
	alert("Число "+minutes+" належить другій чверті!")
} else if (minutes>=30 && minutes<=44) {
	alert("Число "+minutes+" належить третій чверті!")
} else if (minutes>=45 && minutes<=59) {
	alert("Число "+minutes+" належить четвертій чверті!")
} else alert("Число "+minutes+" не належить жодній чверті!!!")

// Завдання 4 (Вивести true, якщо змінні а або b відповідають усім своїм вимогам, якщо ні - false)
var a=+prompt("Введіть число 'a'",5);
var b=+prompt("Введіть число 'b'",5);
if (a>3 && a<12) {
	alert(true)
} else if (b>=5 && b<13) {
	alert(true)
} else alert(false)