var x =+prompt("Перше завдання: ввести число, яке буде возведене у квадрат:",0);
var y = Math.pow(x, 2);
alert ("Число "+x+" у квадраті дорівнює "+y+".");

var a=+prompt("Друге завдання: з двома числами зробити матемитачні оператори. Перше число:",0);
var b=+prompt("Друге число:",0);
var c=a+b;
var d=a-b;
var e=a*b;
var f=a/b;
var g=a%b;
var h=a**b;
alert("Результати: A + B = "+c+";   A - B = "+d+";   A * B = "+e+";   A / B = "+f+";   залишок A після ділення на B = "+g+";   A у ступені B = "+h+".");